testing-scripts/test_multi-client_unencrypted_h2load_throughput_via-B/results/payload-size_100000000____delay-ms_0____loss-rate-percent_0.01____clients-requests_10/1/result.txt
Setting null encryption
starting benchmark...
spawning thread #0: 10 total client(s). 10 total requests
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[WARNING! Using Null-encryption]
[...]
TLS Protocol: TLSv1.3
Cipher: TLS_AES_128_GCM_SHA256
Server Temp Key: X25519 253 bits
Application protocol: h3
progress: 10% done
progress: 20% done
progress: 30% done
progress: 40% done
progress: 50% done
progress: 60% done
progress: 70% done
progress: 80% done
progress: 90% done
progress: 100% done

finished in 3.77s, 2.65 req/s, 252.71MB/s
requests: 10 total, 10 started, 10 done, 10 succeeded, 0 failed, 0 errored, 0 timeout
status codes: 10 2xx, 0 3xx, 0 4xx, 0 5xx
traffic: 953.97MB (1000305930) total, 130B (130) headers (space savings 86.46%), 953.67MB (1000000000) data
UDP datagram: 55698 sent, 821374 received
                     min         max         mean         sd        +/- sd
time for request:      3.75s       3.77s       3.76s      7.03ms    70.00%
time for connect:     4.12ms     26.06ms     15.00ms      7.38ms    60.00%
time to 1st byte:    25.70ms     28.53ms     27.19ms      1.12ms    50.00%
req/s           :       0.26        0.27        0.27        0.00    60.00%